app/Http/Controllers/listingsController.php

    public function index()
    {
        $listings = DB::table('jobatho_listings')
            ->latest()
            ->when(request('tag'), function ($query, $tag) {
                return $query->where('tag', $tag);
            })
            ->when(request('search'), function ($query, $search) {
                return $query->where('title', 'like', '%' . $search . '%');
            })
            ->paginate(6);
---
SELECT * FROM `jobatho_listings` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `jobatho_listings`

    public function show($id)
    {
        $listings = DB::table('jobatho_listings')->find($id);
---
SELECT * FROM `jobatho_listings` WHERE `id` = 'favicon.ico' LIMIT 1

    public function store(Request $request)
    {
        $formFields = $request->validate([
            'title'       => 'required',
            'company'     => ['required', Rule::unique('jobatho_listings', 'company')],
            'location'    => 'required',
            'website'     => 'required',
            'email'       => ['required', 'email'],
            'tags'        => 'required',
            'description' => 'required',
        ]);

        if ($request->hasFile('logo')) {
            $test = $formFields['logo'] = $request->file('logo')->store('upload', 'upload');
        }

        $formFields['user_id'] = auth()->id();

        DB::table('jobatho_listings')->insert($formFields);
---
INSERT INTO `jobatho_listings` (`title`, `company`, `location`, `website`, `email`, `tags`, `description`, `logo`, `user_id`) VALUES ('tuba', 'sariya jannat', 'lkj,aslkdfjals,lsfdasd', 'asdf.com', 'tuba@gmail.com', 'tuba, sariya, jannat', 'sariya jannart tuba valo nah', 'logos/y1siU7NWxEveHM8JTbL0Eg5d5uSqBHoCXtetpUG6.jpg', 6)

    public function delete($id)
    {
        $listings = DB::table('jobatho_listings')->find($id);

        if ($listings->user_id != auth()->id()) {
            abort(403, 'Unauthorized Action');
        }

        DB::table('jobatho_listings')->where('id', $id)->delete();
---
SELECT * FROM `jobatho_listings` WHERE `id` = '17' LIMIT 1
DELETE FROM `jobatho_listings` WHERE `id` = '17'

    public function manage()
    {
        $listings = DB::table('jobatho_listings')->where('user_id', auth()->id())->get();
---
SELECT * FROM `jobatho_listings` WHERE `user_id` = 10