app/Http/Controllers/listingsController.php

    public function index()
    {
        // dd(DB::table('jobatho_listings')->get()->all());
        $listings = DB::table('jobatho_listings')
            ->latest()
            ->when(request('tag'), function ($query, $tag) {
                return $query->where('tag', $tag);
            })
            ->when(request('search'), function ($query, $search) {
                return $query->where('title', 'like', '%' . $search . '%');
            })
            ->paginate(10);
---
SELECT * FROM `jobatho_listings` ORDER BY `created_at` DESC LIMIT 10 offset 0