app/Http/Controllers/usersController.php

    public function store(Request $request)
    {
        $formFields = $request->validate([
            'name' => ['required', 'min:3'],
            'email' => ['required', 'email', Rule::unique('jobatho_users', 'email')],
            'password' => 'required|confirmed|min:6',
        ]);

        // Hash Password
        $formFields['password'] = bcrypt($formFields['password']);

        // Create User using the User model
        $user = User::create($formFields);

        // Login
        auth()->login($user);

        $user_id = [
            'jobatho_user_id' => auth()->user()->id
        ];
        DB::table('jobatho_profile')->insert($user_id);
---
INSERT INTO `jobatho_profile` (`jobatho_user_id`) VALUES (13)